RIET/src/Documents/Blacklist/Blacklist.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Blacklist</name>
  <posting>Deny</posting>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.StatusesOfLineOfBlacklist</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>POLines</name>
    <attributes>
      <name>POLine</name>
      <type>
        <types>CatalogRef.СтрокиЗаявкиНаЗакупку</types>
      </type>
    </attributes>
    <attributes>
      <name>Rule</name>
      <type>
        <types>CatalogRef.RulesOfBlacklist</types>
      </type>
    </attributes>
    <attributes>
      <name>Status</name>
      <type>
        <types>EnumRef.StatusesOfLineOfBlacklist</types>
      </type>
    </attributes>
    <attributes>
      <name>Comment</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Enums/TypesOfRulesOfBlacklist/TypesOfRulesOfBlacklist.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TypesOfRulesOfBlacklist</name>
  <enumValues>
    <name>NotRecommended</name>
  </enumValues>
  <enumValues>
    <name>Prohibited</name>
  </enumValues>
  <enumValues>
    <name>Allowed</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/FieldsForRulesOfBlacklist/FieldsForRulesOfBlacklist.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>FieldsForRulesOfBlacklist</name>
  <enumValues>
    <name>КодПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеНоменклатуры</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/StatusesOfLineOfBlacklist/StatusesOfLineOfBlacklist.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>StatusesOfLineOfBlacklist</name>
  <enumValues>
    <name>New</name>
  </enumValues>
  <enumValues>
    <name>InProcess</name>
  </enumValues>
  <enumValues>
    <name>Closed</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Catalogs/CountriesOfProcessLevels/CountriesOfProcessLevels.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CountriesOfProcessLevels</name>
  <predefined>
    <items>
      <name>AZ</name>
      <description>Azerbaijan</description>
    </items>
    <items>
      <name>BY</name>
      <description>Belarus</description>
    </items>
    <items>
      <name>GE</name>
      <description>Georgia</description>
    </items>
    <items>
      <name>KZ</name>
      <description>Kazakhstan</description>
    </items>
    <items>
      <name>RU</name>
      <description>Russia</description>
    </items>
    <items>
      <name>TM</name>
      <description>Turkmenistan</description>
    </items>
    <items>
      <name>UZ</name>
      <description>Uzbekistan</description>
    </items>
  </predefined>
  <attributes>
    <name>TMSID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NameForMoveIT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Catalogs/RulesOfBlacklist/RulesOfBlacklist.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>RulesOfBlacklist</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>Field</name>
    <type>
      <types>EnumRef.FieldsForRulesOfBlacklist</types>
    </type>
  </attributes>
  <attributes>
    <name>Value</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.TypesOfRulesOfBlacklist</types>
    </type>
  </attributes>
  <attributes>
    <name>GoodsDescription</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Reason</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Catalogs/СтрокиЗаявкиНаЗакупку/СтрокиЗаявкиНаЗакупку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтрокиЗаявкиНаЗакупку</name>
  <owners>Catalog.ЗаявкиНаЗакупку</owners>
  <attributes>
    <name>НомерСтрокиЗаявкиНаЗакупку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Каталог</name>
    <type>
      <types>CatalogRef.Catalog</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.UOMs</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоПоСтроке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоПоСтрокеДолл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Классификатор</name>
    <type>
      <types>EnumRef.ТипыЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>КостЦентр</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>АктивитиКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеРасходов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>90</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНазначенияРасходов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПеревозки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнструкцииПоТранспортировке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециальныеИнструкции</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>SupplierPromisedDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GOLDReceiptDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GoodsReceiptDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DONumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UrgentFlag</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CurrentRDD</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SupplierRequiredDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CountryOfOrigin</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Hub1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ProjectMobilization</name>
    <type>
      <types>CatalogRef.ProjectMobilization</types>
    </type>
  </attributes>
  <attributes>
    <name>GL_From_Segment</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>GL_Date</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Restock</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Restock_Date</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Documents/Blacklist/Forms/ФормаДокумента/Module.bsl
////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.Country) Тогда
			
			Объект.Country = ImportExportСервер.ПолучитьCountryПользователя(ПараметрыСеанса.ТекущийПользователь);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	РГСофтКлиент.ПроверитьНеобходимостьЗаписиДокумента(ПараметрыЗаписи.РежимЗаписи, Объект.Проведен, Модифицированность, Отказ);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//ПараметрыЗаписи.Вставить("ТочноеВремяНачала", ОценкаПроизводительностиРГСофт.ТочноеВремя());
	
	ТекущийОбъект.ModifiedBy = ПараметрыСеанса.ТекущийПользователь;
	ТекущийОбъект.ModificationDate = ТекущаяДата();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//ОценкаПроизводительностиРГСофт.ЗафиксироватьВремяОкончания(ПараметрыЗаписи.ТочноеВремяНачала, Справочники.КлючевыеОперации.BlacklistИнтерактивнаяЗапись, Объект.Ссылка);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////////
// ТАБЛИЧНАЯ ЧАСТЬ

&НаКлиенте
Процедура Fill(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Country) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""Country"" is empty!",
			, "Country", "Объект");
		Возврат;
	КонецЕсли;
	
	Очистить = Ложь;
	Если Объект.POLines.Количество() > 0 Тогда
	
		Ответ = Вопрос("Clear table?", РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет, , КодВозвратаДиалога.Нет);
		Очистить = Ответ = КодВозвратаДиалога.Да;
	
	КонецЕсли; 
	
	ЗаполнитьНаСервере(Очистить);
	
КонецПроцедуры

// ДОДЕЛАТЬ
&НаСервере
Процедура ЗаполнитьНаСервере(Очистить)
	
	//ТочноеВремяНачала = ОценкаПроизводительностиРГСофт.ТочноеВремя();	
	
	Если Очистить Тогда
		Объект.POLines.Очистить();
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	
	// ДОБАВИТЬ БЫ ЭТО В СПРАВОЧНИК СТРАН
	ИсключаемыеСтраны = Новый Массив;
	Если Объект.Country = Справочники.CountriesOfProcessLevels.RU Тогда
		
		ИсключаемыеСтраны.Добавить("Russian Federation");
		ИсключаемыеСтраны.Добавить("Russia");
		
	ИначеЕсли Объект.Country = Справочники.CountriesOfProcessLevels.KZ Тогда
		
		ИсключаемыеСтраны.Добавить("Kazakhstan");
		
	ИначеЕсли Объект.Country = Справочники.CountriesOfProcessLevels.UZ Тогда
		
		ИсключаемыеСтраны.Добавить("Uzbekistan");

	ИначеЕсли Объект.Country = Справочники.CountriesOfProcessLevels.AZ Тогда
		
		ИсключаемыеСтраны.Добавить("Azerbaijan");
		
	ИначеЕсли Объект.Country = Справочники.CountriesOfProcessLevels.TM Тогда
		
		ИсключаемыеСтраны.Добавить("Turkmenistan");
		
	КонецЕсли;
	Запрос.УстановитьПараметр("ИсключаемыеСтраны", ИсключаемыеСтраны);
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Country", Объект.Country);
	Запрос.УстановитьПараметр("CurrentPOLines", РГСофтКлиентСервер.ВыгрузитьКолонкуКоллекцииБезПустыхЗначенийИДублей(Объект.POLines, "POLine"));
	
	// Запрос построим так:
	// Вначале сформируем 4 временных таблицы: NotAllowedRulesByPartNo, NotAllowedRulesByDescription, AllowedRulesByPartNo, AllowedRulesByDescription
	// Потом соединим справочник PO lines с этими таблицами, а также с таблицами блеклистов и товаров, чтобы отсечь PO lines которые уже попали в другие блеклисты или вошли в инвойсы
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Rules.Ссылка,
		|	Rules.Value
		|ПОМЕСТИТЬ NotAllowedRulesByPartNo
		|ИЗ
		|	Справочник.RulesOfBlacklist КАК Rules
		|ГДЕ
		|	Rules.Country = &Country
		|	И Rules.Type <> ЗНАЧЕНИЕ(Перечисление.TypesOfRulesOfBlacklist.Allowed)
		|	И Rules.Field = ЗНАЧЕНИЕ(Перечисление.FieldsForRulesOfBlacklist.КодПоставщика)
		|	И (НЕ Rules.ПометкаУдаления)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Rules.Value
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Rules.Ссылка,
		|	Rules.Value
		|ПОМЕСТИТЬ NotAllowedRulesByDescription
		|ИЗ
		|	Справочник.RulesOfBlacklist КАК Rules
		|ГДЕ
		|	Rules.Country = &Country
		|	И Rules.Type <> ЗНАЧЕНИЕ(Перечисление.TypesOfRulesOfBlacklist.Allowed)
		|	И Rules.Field = ЗНАЧЕНИЕ(Перечисление.FieldsForRulesOfBlacklist.ОписаниеНоменклатуры)
		|	И (НЕ Rules.ПометкаУдаления)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Rules.Value
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Rules.Value
		|ПОМЕСТИТЬ AllowedRulesByPartNo
		|ИЗ
		|	Справочник.RulesOfBlacklist КАК Rules
		|ГДЕ
		|	Rules.Country = &Country
		|	И Rules.Type = ЗНАЧЕНИЕ(Перечисление.TypesOfRulesOfBlacklist.Allowed)
		|	И Rules.Field = ЗНАЧЕНИЕ(Перечисление.FieldsForRulesOfBlacklist.КодПоставщика)
		|	И (НЕ Rules.ПометкаУдаления)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Rules.Value
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Rules.Value
		|ПОМЕСТИТЬ AllowedRulesByDescription
		|ИЗ
		|	Справочник.RulesOfBlacklist КАК Rules
		|ГДЕ
		|	Rules.Country = &Country
		|	И Rules.Type = ЗНАЧЕНИЕ(Перечисление.TypesOfRulesOfBlacklist.Allowed)
		|	И Rules.Field = ЗНАЧЕНИЕ(Перечисление.FieldsForRulesOfBlacklist.ОписаниеНоменклатуры)
		|	И (НЕ Rules.ПометкаУдаления)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Rules.Value
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтрокиЗаявкиНаЗакупку.Ссылка КАК POLine,
		|	ЕСТЬNULL(NotAllowedRulesByPartNo.Ссылка, NotAllowedRulesByDescription.Ссылка) КАК Rule
		|ИЗ
		|	Справочник.СтрокиЗаявкиНаЗакупку КАК СтрокиЗаявкиНаЗакупку
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Blacklist.POLines КАК BlacklistPOLines
		|		ПО СтрокиЗаявкиНаЗакупку.Ссылка = BlacklistPOLines.POLine
		|			И ((НЕ BlacklistPOLines.Ссылка.ПометкаУдаления))
		|			И (BlacklistPOLines.Ссылка <> &Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтрокиИнвойса КАК СтрокиИнвойса
		|		ПО СтрокиЗаявкиНаЗакупку.Ссылка = СтрокиИнвойса.СтрокаЗаявкиНаЗакупку
		|			И ((НЕ СтрокиИнвойса.ПометкаУдаления))
		|			И ((НЕ СтрокиИнвойса.Инвойс.Отменен))
		|		ЛЕВОЕ СОЕДИНЕНИЕ AllowedRulesByPartNo КАК AllowedRulesByPartNo
		|		ПО СтрокиЗаявкиНаЗакупку.КодПоставщика = AllowedRulesByPartNo.Value
		|		ЛЕВОЕ СОЕДИНЕНИЕ AllowedRulesByDescription КАК AllowedRulesByDescription
		|		ПО (СтрокиЗаявкиНаЗакупку.ОписаниеНоменклатуры ПОДОБНО ""%"" + AllowedRulesByDescription.Value + ""%"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ NotAllowedRulesByPartNo КАК NotAllowedRulesByPartNo
		|		ПО СтрокиЗаявкиНаЗакупку.КодПоставщика = NotAllowedRulesByPartNo.Value
		|		ЛЕВОЕ СОЕДИНЕНИЕ NotAllowedRulesByDescription КАК NotAllowedRulesByDescription
		|		ПО (СтрокиЗаявкиНаЗакупку.ОписаниеНоменклатуры ПОДОБНО ""%"" + NotAllowedRulesByDescription.Value + ""%"")
		|ГДЕ
		|	(СтрокиЗаявкиНаЗакупку.Владелец.БОРГ.Компания.Country = &Country)
		|	И СтрокиЗаявкиНаЗакупку.Владелец.ДатаЗаявкиНаЗакупку >= ДАТАВРЕМЯ(2011, 1, 1)
		|	И НЕ СтрокиЗаявкиНаЗакупку.Владелец.СтранаПоставщика В (&ИсключаемыеСтраны)
		|	И (НЕ СтрокиЗаявкиНаЗакупку.ПометкаУдаления)
		|	И (НЕ СтрокиЗаявкиНаЗакупку.Ссылка В (&CurrentPOLines))
		|	И BlacklistPOLines.POLine ЕСТЬ NULL 
		|	И СтрокиИнвойса.СтрокаЗаявкиНаЗакупку ЕСТЬ NULL 
		|	И AllowedRulesByPartNo.Value ЕСТЬ NULL 
		|	И AllowedRulesByDescription.Value ЕСТЬ NULL 
		|	И (НЕ(NotAllowedRulesByPartNo.Ссылка ЕСТЬ NULL 
		|				И NotAllowedRulesByDescription.Ссылка ЕСТЬ NULL ))
		|
		|УПОРЯДОЧИТЬ ПО
		|	POLine";
		
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("POLine") Цикл
		
		НоваяСтрокаТЧ = Объект.POLines.Добавить();
		НоваяСтрокаТЧ.POLine = Выборка.POLine;
		НоваяСтрокаТЧ.Rule = Выборка.Rule;
		НоваяСтрокаТЧ.Status = Перечисления.StatusesOfLineOfBlacklist.New;
		
	КонецЦикла; 
	
	Модифицированность = Истина;
	
	//ОценкаПроизводительностиРГСофт.ЗафиксироватьВремяОкончания(ТочноеВремяНачала, Справочники.КлючевыеОперации.BlacklistИнтерактивноеЗаполнение, Объект.Ссылка);
	
КонецПроцедуры
